
let RECORDS = [
    {
        "id": "1",
        "name": "金宝林",
        "address": "长安新城43-602",
        "level": "高龄老人"
    },
    {
        "id": "2",
        "name": "孙庆龙",
        "address": "长安新城16-2-502",
        "level": "退伍军人"
    },
    {
        "id": "3",
        "name": "车兴",
        "address": "安新城8-2-101",
        "level": "残疾人"
    },
    {
        "id": "4",
        "name": "肖松",
        "address": "长安新城53-1-2202",
        "level": "低保户"
    },
    {
        "id": "5",
        "name": "杨宇宏",
        "address": "长安新城50-1-1101",
        "level": "退伍军人"
    },
    {
        "id": "6",
        "name": "于恩鹏",
        "address": "长安新城3-3-802",
        "level": "退伍军人"
    },
    {
        "id": "7",
        "name": "魏庆良",
        "address": "长安新城23-4-302",
        "level": "高龄老人"
    },
    {
        "id": "8",
        "name": "吴振华",
        "address": "长安新城28-2-902",
        "level": "退伍军人"
    },
    {
        "id": "9",
        "name": "唐明",
        "address": "长安新城28-1-102",
        "level": "高龄老人"
    },
    {
        "id": "10",
        "name": "陈勇",
        "address": "长安新城28-1-202",
        "level": "残疾人"
    },
    {
        "id": "11",
        "name": "王春",
        "address": "长安新城1-2-501",
        "level": "高龄老人"
    },
    {
        "id": "12",
        "name": "武传辉",
        "address": "长安新城31-2-701",
        "level": "退伍军人"
    },
    {
        "id": "13",
        "name": "杨文波",
        "address": "长安新城24-1-501",
        "level": "高龄老人"
    },
    {
        "id": "14",
        "name": "王亭延",
        "address": "长安新城10-2-401",
        "level": "高龄老人"
    },
    {
        "id": "15",
        "name": "郭友松",
        "address": "长安新城46-1-401",
        "level": "高龄老人"
    },
    {
        "id": "16",
        "name": "张忠良",
        "address": "长安新城34-1-701",
        "level": "退伍军人"
    },
    {
        "id": "17",
        "name": "马伯恺",
        "address": "长安新城24-1-501",
        "level": "高龄老人"
    },
    {
        "id": "18",
        "name": "蒋文文",
        "address": "长安新城10-2-401",
        "level": "退伍军人"
    },
    {
        "id": "19",
        "name": "刘星",
        "address": "长安新城46-1-401",
        "level": "残疾人"
    },
    {
        "id": "20",
        "name": "王珊",
        "address": "长安新城34-1-701",
        "level": "高龄老人"
    },  {
        "id": "21",
        "name": "贾静文",
        "address": "长安新城24-1-501",
        "level": "高龄老人"
    },
    {
        "id": "22",
        "name": "刘多男",
        "address": "长安新城10-2-401",
        "level": "残疾人"
    },
    {
        "id": "23",
        "name": "马尔皮",
        "address": "长安新城46-1-401",
        "level": "退伍军人"
    },
    {
        "id": "24",
        "name": "张国良",
        "address": "长安新城34-1-701",
        "level": "低保户"
    }
]
export default RECORDS