<template>
	<div class="village">
		<div class="header"></div>


		<div class="message" :v-show="message">
			消息：南京谷里梅花节2023年2月13日至3月12日火热进行中！
		</div>

		<div :id="mapid" class="ktmap"></div>

		<div id="info-popup" class="cesium-popup">
			<!-- <a class="cesium-popup-close-button cesium-popup-color" @click="closePopup" onclick="">×</a> -->
			<div class="cesium-popup-background">
				<div class="tooltip-name">{{ popupInfo.name }}</div>
				<div class="tooltip-content tooltip-pic">
					<el-image class="tooltip-photo" :src="popupInfo.photos[Math.floor(Math.random() * 10)]"
						:preview-src-list="popupInfo.photos" fit="cover" />
				</div>
				<div class="tooltip-content tooltip-intr">
					<div class="tooltip-content-explain1">
						<div class="tooltip-content-title">坐标信息：</div>
						<div class="tooltip-content-describe">东经{{ popupInfo.lng }}，北纬{{ popupInfo.lat }}</div>
					</div>
					<div class="tooltip-content-explain2">
						<div class="tooltip-content-title">简介：</div>
						<div class="tooltip-content-describe">{{ popupInfo.describe[Math.floor(Math.random() * 10)] }}</div>
					</div>
					<div>
						<el-link class="link" type="primary" @click="openNewPage">VR全景图</el-link>
					</div>
				</div>
			</div>
		</div>

		<plateLeft :v-show="left" id="plateLeft"></plateLeft>
		<plateRight :v-show="right" id="plateRight"></plateRight>

		<div id="bottom">
			<div class="b_card" @click="cardEvent(1)">
				<el-image v-show="card1" class="bottom_img" :src="cards.url1"></el-image>
				<el-image v-show="!card1" class="bottom_img" :src="cards.url2"></el-image>
				<p class="b_name">乡村全景</p>
			</div>

			<div class="b_card" @click="cardEvent(2)">
				<el-image v-show="card2" class="bottom_img" :src="cards.url3"></el-image>
				<el-image v-show="!card2" class="bottom_img" :src="cards.url4"></el-image>
				<p class="b_name">特色地名</p>
			</div>
			<div class="b_card" @click="cardEvent(3)">
				<el-image v-show="card3" class="bottom_img" :src="cards.url5"></el-image>
				<el-image v-show="!card3" class="bottom_img" :src="cards.url6"></el-image>
				<p class="b_name">旅游</p>
			</div>
			<div class="b_card" @click="cardEvent(4)">
				<el-image v-show="card4" class="bottom_img" :src="cards.url7"></el-image>
				<el-image v-show="!card4" class="bottom_img" :src="cards.url8"></el-image>
				<p class="b_name">农产品</p>
			</div>

		</div>
	</div>
</template>

<script>
import plateLeft from "./plateLeft.vue";
import plateRight from "./plateRight.vue";

import * as uuid from "uuid"
import * as Speed from '@/cesiumSDK/index'
import * as token from '@/cesiumSDK/core/util/token'
import * as Cesium from "cesium";
import { ElMessage } from 'element-plus'

let feature = [{ "name": "肖家桥", "clampedCartesian": { "x": -2600378.350508144, "y": 4755463.723570151, "z": 3350924.7932358016 } }, { "name": "清水塘", "clampedCartesian": { "x": -2607333.273235176, "y": 4756401.998676071, "z": 3344287.976881678 } }, { "name": "大兴山", "clampedCartesian": { "x": -2604620.7794542187, "y": 4757885.789065587, "z": 3344278.0852206964 } }, { "name": "淘米山", "clampedCartesian": { "x": -2599989.5371510107, "y": 4758887.5712796515, "z": 3346497.892565704 } }, { "name": "大塘金水库", "clampedCartesian": { "x": -2605234.049054812, "y": 4755554.867507579, "z": 3347099.4387353887 } }, { "name": "老丘口灌区", "clampedCartesian": { "x": -2601459.866470509, "y": 4755483.563757079, "z": 3350070.3791992213 } }, { "name": "谷里灌区" }, { "name": "岱山", "clampedCartesian": { "x": -2602256.690688589, "y": 4752726.923530339, "z": 3353490.6465214454 } }, { "name": "风波坟水库", "clampedCartesian": { "x": -4873.161719020456, "y": 8887.20900421124, "z": -16257.399293323979 } }, { "name": "官塘", "clampedCartesian": { "x": -4873.620577446185, "y": 8888.15800909046, "z": -16257.618809266016 } }, { "name": "谷里街道三板桥", "clampedCartesian": { "x": -4880.599081774242, "y": 8907.284236397594, "z": -16262.322899834719 } }, { "name": "汤家", "clampedCartesian": { "x": -4880.590511656366, "y": 8908.565220760182, "z": -16262.13030116912 } }, { "name": "皇姑山", "clampedCartesian": { "x": -2606444.8568832995, "y": 4758370.995267392, "z": 3342227.1075131595 } }, { "name": "东塘水库", "clampedCartesian": { "x": -4855.034744290169, "y": 8865.667790261097, "z": -16251.09366251016 } }, { "name": "向阳社区居民委员会", "clampedCartesian": { "x": -2601530.791523237, "y": 4756011.856533682, "z": 3349303.892650839 } }, { "name": "柏树社区村民委员会", "clampedCartesian": { "x": -4863.204473666847, "y": 8902.817809151486, "z": -16259.576498172712 } }, { "name": "林木山", "clampedCartesian": { "x": -4853.221896868665, "y": 8871.543008286506, "z": -16252.018239907455 } }, { "name": "高山水库", "clampedCartesian": { "x": -4852.9113946268335, "y": 8875.965785805136, "z": -16252.888857932296 } }, { "name": "东花塘水库", "clampedCartesian": { "x": -4852.6403148151, "y": 8877.391546540894, "z": -16253.030475466512 } }, { "name": "公塘社区居民委员会", "clampedCartesian": { "x": -2604340.173050591, "y": 4758271.534141201, "z": 3343952.4667004226 } }, { "name": "艾上", "clampedCartesian": { "x": -4851.507921786513, "y": 8875.840168140829, "z": -16252.8007282326 } }, { "name": "菜籽岘", "clampedCartesian": { "x": -4851.831493307836, "y": 8871.769362906925, "z": -16252.016391039826 } }, { "name": "曹上", "clampedCartesian": { "x": -4852.715177265927, "y": 8878.365832599811, "z": -16253.461893503554 } }, { "name": "江宁街道大庄", "clampedCartesian": { "x": -4851.131660963409, "y": 8870.773073150776, "z": -16251.790620434564 } }, { "name": "南门后", "clampedCartesian": { "x": -4850.623294885736, "y": 8875.18453844823, "z": -16252.296138506383 } }, { "name": "南门头", "clampedCartesian": { "x": -4850.172614521347, "y": 8873.461505624466, "z": -16252.197404025123 } }, { "name": "千里", "clampedCartesian": { "x": -4853.337643707171, "y": 8874.287313548848, "z": -16252.720256230328 } }, { "name": "湾山", "clampedCartesian": { "x": -4853.8494864399545, "y": 8878.264793119393, "z": -16253.379027993418 } }, { "name": "谷里街道鸡笼山", "clampedCartesian": { "x": -2606275.0379081797, "y": 4755102.075290291, "z": 3347060.3126500878 } }, { "name": "白茅山", "clampedCartesian": { "x": -4850.825906021986, "y": 8864.9348093085, "z": -16250.381713911425 } }, { "name": "大山头", "clampedCartesian": { "x": -2606275.2616776708, "y": 4758783.939464535, "z": 3341734.1492561703 } }, { "name": "赵宕水库", "clampedCartesian": { "x": -4876.953957675956, "y": 8902.257354338653, "z": -16260.840332734399 } }, { "name": "金牛洞山", "clampedCartesian": { "x": -4866.848801468033, "y": 8893.17287584953, "z": -16257.856827744748 } }, { "name": "石坝社区村民委员会", "clampedCartesian": { "x": -2599671.0610922375, "y": 4756617.547376198, "z": 3349842.514900423 } }, { "name": "亲见社区村民委员会", "clampedCartesian": { "x": -2601109.178727468, "y": 4757961.621906741, "z": 3346860.8893082133 } }, { "name": "官山", "clampedCartesian": { "x": -2604750.3003692576, "y": 4753896.207327196, "z": 3349820.197936992 } }, { "name": "双塘社区村民委员会", "clampedCartesian": { "x": -2604824.7931072796, "y": 4755783.719344035, "z": 3347101.718643191 } }, { "name": "庆缘花苑", "clampedCartesian": { "x": -2602955.343239848, "y": 4756246.435910408, "z": 3347881.1985989623 } }, { "name": "谷里街道", "clampedCartesian": { "x": -2602806.13344126, "y": 4756443.78594303, "z": 3347724.9917063443 } }, { "name": "砻篰塘水库", "clampedCartesian": { "x": -4855.675581477582, "y": 8876.007008415647, "z": -16253.719756953884 } }, { "name": "宕前", "clampedCartesian": { "x": -2602243.7058991212, "y": 4756183.831688912, "z": 3348495.8472617073 } }, { "name": "蒋云庵", "clampedCartesian": { "x": -2605810.1971257892, "y": 4756854.832857856, "z": 3344809.539571329 } }, { "name": "谷里街道工业集中区", "clampedCartesian": { "x": -2602570.2576128403, "y": 4755822.63523079, "z": 3348758.4992519175 } }, { "name": "江宁河灌区", "clampedCartesian": { "x": -2598128.4679545886, "y": 4759510.887672438, "z": 3346953.0405566082 } }, { "name": "薛家沟", "clampedCartesian": { "x": -2599712.477196443, "y": 4756031.33605643, "z": 3350635.888090416 } }, { "name": "红庙水库灌区", "clampedCartesian": { "x": -2601980.4082928193, "y": 4758155.327030066, "z": 3345932.7001295146 } }, { "name": "梁塘水库", "clampedCartesian": { "x": -2606117.534983955, "y": 4754750.445611933, "z": 3347633.186645384 } }, { "name": "赤岸", "clampedCartesian": { "x": -2599563.020567958, "y": 4756479.844295251, "z": 3350119.185695299 } }, { "name": "朱山村", "clampedCartesian": { "x": -2599493.065327237, "y": 4757863.301965677, "z": 3348240.43893722 } }, { "name": "虎山", "clampedCartesian": { "x": -2605146.9699905924, "y": 4759701.357750608, "z": 3341350.019706154 } }, { "name": "小山", "clampedCartesian": { "x": -4882.333570171148, "y": 8920.046276601963, "z": -16264.980743336026 } }, { "name": "张溪社区居民委员会", "clampedCartesian": { "x": -2602779.931474979, "y": 4758494.319238441, "z": 3344825.1306560794 } }, { "name": "箭塘社区居民委员会", "clampedCartesian": { "x": -2604101.965354198, "y": 4753628.779319156, "z": 3350688.456830047 } }, { "name": "谷里社区居民委员会", "clampedCartesian": { "x": -2602473.873299256, "y": 4756586.066341122, "z": 3347776.344318624 } }, { "name": "荆刘社区村民委员会", "clampedCartesian": { "x": -2601211.367779545, "y": 4753942.858939439, "z": 3352448.525712436 } }, { "name": "新民花苑", "clampedCartesian": { "x": -2603715.3130039456, "y": 4755932.8460508445, "z": 3347764.3479140652 } }, { "name": "九岛梦都城", "clampedCartesian": { "x": -2603010.1955921506, "y": 4755091.419093548, "z": 3349452.0306339283 } }, { "name": "瑞安翠湖山居", "clampedCartesian": { "x": -4876.837216592394, "y": 8903.072781710885, "z": -16260.905564628541 } }, { "name": "赵宕", "clampedCartesian": { "x": -2604190.3710498186, "y": 4754348.700407136, "z": 3349601.2444913653 } }, { "name": "邵顾店", "clampedCartesian": { "x": -2602905.495564728, "y": 4756233.453785687, "z": 3347981.8989013433 } }, { "name": "翟家村", "clampedCartesian": { "x": -2603046.6453897366, "y": 4755871.181434911, "z": 3348322.102218778 } }, { "name": "许家凹", "clampedCartesian": { "x": -2606128.3139065434, "y": 4755424.156635516, "z": 3346647.0775259295 } }, { "name": "大岭岗", "clampedCartesian": { "x": -2602065.797911196, "y": 4759418.869220982, "z": 3344061.6198375644 } }, { "name": "亭子村", "clampedCartesian": { "x": -2602536.1901245075, "y": 4755312.938865196, "z": 3349501.316810182 } }, { "name": "宕庄", "clampedCartesian": { "x": -2602117.1848527403, "y": 4756023.543677857, "z": 3348817.213902286 } }, { "name": "公塘社区白粉墙", "clampedCartesian": { "x": -2605241.6754749017, "y": 4758365.915926292, "z": 3343103.1738639264 } }, { "name": "向阳社区白粉墙", "clampedCartesian": { "x": -4869.348756956402, "y": 8902.708350781351, "z": -16259.886010752525 } }, { "name": "鲍塘村", "clampedCartesian": { "x": -2601850.347920946, "y": 4755850.161770068, "z": 3349263.698340141 } }, { "name": "蔡家村", "clampedCartesian": { "x": -2605586.4232354863, "y": 4756401.9715601625, "z": 3345629.901988605 } }, { "name": "大柏树", "clampedCartesian": { "x": -2599162.714640423, "y": 4757420.453957097, "z": 3349110.722718694 } }, { "name": "大杨村", "clampedCartesian": { "x": -2604381.8864064966, "y": 4758913.393985411, "z": 3343004.2772882655 } }, { "name": "车家湾", "clampedCartesian": { "x": -2603505.8220878844, "y": 4757981.337113266, "z": 3345004.910530109 } }, { "name": "店门口", "clampedCartesian": { "x": -4869.972760888282, "y": 8910.80884528067, "z": -16262.021325740498 } }, { "name": "大段山", "clampedCartesian": { "x": -2602455.4577471307, "y": 4754015.130633827, "z": 3351378.480286591 } }, { "name": "大甘里", "clampedCartesian": { "x": -4870.90395105537, "y": 8905.077855959535, "z": -16260.634575328324 } }, { "name": "丁家", "clampedCartesian": { "x": -4865.033291659318, "y": 8878.629418841563, "z": -16255.378774795216 } }, { "name": "谷里街道长冲", "clampedCartesian": { "x": -2602252.091033456, "y": 4758990.72127652, "z": 3344542.150733965 } }, { "name": "大湖村", "clampedCartesian": { "x": -2602583.594437433, "y": 4757940.661993315, "z": 3345760.4840246434 } }, { "name": "大蒋店", "clampedCartesian": { "x": -4875.258772536181, "y": 8899.267189092003, "z": -16260.138425864745 } }, { "name": "大马湾", "clampedCartesian": { "x": -4878.626207222231, "y": 8918.188286032528, "z": -16264.542592859361 } }, { "name": "大栏杆", "clampedCartesian": { "x": -2603013.3042761423, "y": 4758718.241288073, "z": 3344323.2841233937 } }, { "name": "方家", "clampedCartesian": { "x": -2604057.641246849, "y": 4758637.7498345645, "z": 3343669.5035405005 } }, { "name": "高庙", "clampedCartesian": { "x": -2602675.4341394375, "y": 4756636.064215951, "z": 3347538.8115369594 } }, { "name": "谷里街道傅家", "clampedCartesian": { "x": -4856.603046948556, "y": 8894.547265011817, "z": -16257.271158425603 } }, { "name": "大泉村", "clampedCartesian": { "x": -2604368.6303901277, "y": 4755244.883091012, "z": 3348205.320035133 } }, { "name": "大孙村", "clampedCartesian": { "x": -2601903.5013211644, "y": 4754086.81346786, "z": 3351708.429183534 } }, { "name": "大湾沟", "clampedCartesian": { "x": -2601589.688412851, "y": 4758109.10730734, "z": 3346280.3861554805 } }, { "name": "大塘金", "clampedCartesian": { "x": -2605432.353967621, "y": 4755617.151055933, "z": 3346888.9655423746 } }, { "name": "公塘头", "clampedCartesian": { "x": -2605174.1345059406, "y": 4758701.0731053455, "z": 3342684.9472433585 } }, { "name": "大夏家", "clampedCartesian": { "x": -2605034.5256521716, "y": 4757076.793493462, "z": 3345103.3025822216 } }, { "name": "东山口", "clampedCartesian": { "x": -2603990.7096135, "y": 4759461.2764030425, "z": 3342530.648066162 } }, { "name": "杜家坝", "clampedCartesian": { "x": -4866.237864821684, "y": 8887.945927866735, "z": -16256.8080909173 } }, { "name": "黄家", "clampedCartesian": { "x": -4882.875245090108, "y": 8912.498607479036, "z": -16263.33877931675 } }, { "name": "九家塘", "clampedCartesian": { "x": -4883.055212577339, "y": 8912.833104170859, "z": -16263.977451792918 } }, { "name": "浦家", "clampedCartesian": { "x": -4881.929488537833, "y": 8913.283602149226, "z": -16263.896554523613 } }, { "name": "王家槽坊", "clampedCartesian": { "x": -4881.361587348394, "y": 8911.942107582465, "z": -16263.196633999702 } }, { "name": "谷里街道周家", "clampedCartesian": { "x": -4881.581162222661, "y": 8912.414233596064, "z": -16263.587641500402 } }, { "name": "赤家", "clampedCartesian": { "x": -4882.797965722624, "y": 8912.313389150426, "z": -16263.401067816652 } }, { "name": "端村", "clampedCartesian": { "x": -2602354.8103245576, "y": 4753152.163665056, "z": 3352686.1547138332 } }, { "name": "鄂儿岗", "clampedCartesian": { "x": -4877.046596951317, "y": 8915.012111285701, "z": -16263.636004044209 } }, { "name": "公家庄", "clampedCartesian": { "x": -2605904.1714596474, "y": 4759275.563817849, "z": 3341307.043914867 } }, { "name": "公山寺", "clampedCartesian": { "x": -2600870.563280529, "y": 4758399.059265743, "z": 3346454.6175097297 } }, { "name": "官塘坝", "clampedCartesian": { "x": -2601250.0700107585, "y": 4755554.965377847, "z": 3350133.3572961395 } }, { "name": "官塘稍", "clampedCartesian": { "x": -2602648.752899124, "y": 4758305.340671563, "z": 3345191.902939426 } }, { "name": "谷里街道和尚庄", "clampedCartesian": { "x": -2600541.4125266504, "y": 4758025.16055219, "z": 3347235.779194109 } }, { "name": "李家庄", "clampedCartesian": { "x": -2600488.3730022837, "y": 4756511.862454517, "z": 3349370.646215693 } }, { "name": "翰林桥", "clampedCartesian": { "x": -2605400.367525814, "y": 4756146.850955818, "z": 3346142.2906675073 } }, { "name": "谷里街道红庙", "clampedCartesian": { "x": -2601131.853415471, "y": 4758720.628173038, "z": 3345796.067255441 } }, { "name": "红土", "clampedCartesian": { "x": -2604301.9661988807, "y": 4757306.860385191, "z": 3345345.3995725717 } }, { "name": "后张毗", "clampedCartesian": { "x": -2603081.032192523, "y": 4754259.010477699, "z": 3350562.4286311762 } }, { "name": "六家庄", "clampedCartesian": { "x": -2600679.192979769, "y": 4755691.027262305, "z": 3350374.2415761454 } }, { "name": "后坟村", "clampedCartesian": { "x": -2603278.8378086695, "y": 4757548.506027904, "z": 3345783.6667798357 } }, { "name": "鸡儿岗", "clampedCartesian": { "x": -2601948.256376097, "y": 4757421.907629829, "z": 3346977.1821888643 } }, { "name": "江家", "clampedCartesian": { "x": -2598304.843426314, "y": 4758704.132887469, "z": 3347953.9739389643 } }, { "name": "街西", "clampedCartesian": { "x": -2602315.208689266, "y": 4756762.881791632, "z": 3347631.163450679 } }, { "name": "街北", "clampedCartesian": { "x": -2602332.0007111053, "y": 4756620.526698999, "z": 3347818.9245530893 } }, { "name": "马府院", "clampedCartesian": { "x": -2602379.911098011, "y": 4757814.000927446, "z": 3346095.8521383945 } }, { "name": "尖山脚", "clampedCartesian": { "x": -2599898.6186224236, "y": 4758399.810104301, "z": 3347193.264641563 } }, { "name": "金家庄", "clampedCartesian": { "x": -4859.380944659002, "y": 8899.62728968449, "z": -16258.373602847569 } }, { "name": "梁家", "clampedCartesian": { "x": -2598745.5618831697, "y": 4757984.543397966, "z": 3348659.743910715 } }, { "name": "梁塘", "clampedCartesian": { "x": -2605709.548184934, "y": 4754904.997273009, "z": 3347674.5736659197 } }, { "name": "刘牧岗", "clampedCartesian": { "x": -2600904.920126377, "y": 4753414.053489916, "z": 3353406.923122911 } }, { "name": "刘后", "clampedCartesian": { "x": -4861.749728793278, "y": 8895.868184992112, "z": -16257.908181509003 } }, { "name": "前张毗", "clampedCartesian": { "x": -2603200.438759898, "y": 4754477.01743026, "z": 3350164.9665606506 } }, { "name": "陆宕", "clampedCartesian": { "x": -4877.141901622526, "y": 8904.972531953827, "z": -16261.550655649975 } }, { "name": "卢村", "clampedCartesian": { "x": -2604822.97942701, "y": 4759098.4020569315, "z": 3342390.763321409 } }, { "name": "箩家宕", "clampedCartesian": { "x": -2605092.932408223, "y": 4758643.564188245, "z": 3342824.708679476 } }, { "name": "琵琶井", "clampedCartesian": { "x": -2599872.954169751, "y": 4757596.58764181, "z": 3348329.1978298603 } }, { "name": "谷里街道马场", "clampedCartesian": { "x": -2599765.934404422, "y": 4758254.814078591, "z": 3347495.385904183 } }, { "name": "谷里街道潘家", "clampedCartesian": { "x": -2603125.3753936756, "y": 4752716.321509783, "z": 3352723.2260795296 } }, { "name": "彭家村", "clampedCartesian": { "x": -2603171.634845005, "y": 4759007.593888287, "z": 3343797.3990089344 } }, { "name": "祁家庄", "clampedCartesian": { "x": -2599296.9633313557, "y": 4755993.950492263, "z": 3351015.882933687 } }, { "name": "蒲塘凹", "clampedCartesian": { "x": -2603693.768036971, "y": 4753757.931340068, "z": 3350808.427931775 } }, { "name": "前花岗", "clampedCartesian": { "x": -2603831.091811765, "y": 4755029.3680897355, "z": 3348921.577274804 } }, { "name": "亲见春", "clampedCartesian": { "x": -2601330.2996483645, "y": 4757753.102247317, "z": 3346989.6429638765 } }, { "name": "四门口", "clampedCartesian": { "x": -2603353.2400856647, "y": 4756789.655011294, "z": 3346795.355472433 } }, { "name": "乔家", "clampedCartesian": { "x": -2598593.517753219, "y": 4759270.717195626, "z": 3346952.08652951 } }, { "name": "沙墙", "clampedCartesian": { "x": -4870.628107539378, "y": 8892.51000787504, "z": -16258.296352738049 } }, { "name": "山后村", "clampedCartesian": { "x": -2604494.614514146, "y": 4758621.108268386, "z": 3343327.3822629526 } }, { "name": "山边吴", "clampedCartesian": { "x": -2605043.891688448, "y": 4755226.306854573, "z": 3347718.6817675023 } }, { "name": "山头李", "clampedCartesian": { "x": -2601087.556007134, "y": 4755446.38091163, "z": 3350422.7062851298 } }, { "name": "上砖墙", "clampedCartesian": { "x": -2599061.4484913754, "y": 4759005.782214077, "z": 3346952.9106100616 } }, { "name": "石明张", "clampedCartesian": { "x": -2604424.09201171, "y": 4755875.618975889, "z": 3347279.9385083974 } }, { "name": "山头吴", "clampedCartesian": { "x": -2601279.988670896, "y": 4755196.131607144, "z": 3350626.524951465 } }, { "name": "沈家", "clampedCartesian": { "x": -4879.416396070737, "y": 8918.626874662936, "z": -16264.864061184227 } }, { "name": "谷里街道沈庄", "clampedCartesian": { "x": -2603231.0758537846, "y": 4752259.880061714, "z": 3353268.8652700093 } }, { "name": "石塔", "clampedCartesian": { "x": -2600459.757580427, "y": 4757914.887186464, "z": 3347456.568257223 } }, { "name": "宋家", "clampedCartesian": { "x": -2604842.5757903913, "y": 4756977.147425377, "z": 3345394.6549795736 } }, { "name": "松园", "clampedCartesian": { "x": -2604713.381849293, "y": 4756580.934806737, "z": 3346067.0650256258 } }, { "name": "谷里街道孙家", "clampedCartesian": { "x": -2606519.4596911706, "y": 4756234.685991113, "z": 3345154.2303758184 } }, { "name": "太白店", "clampedCartesian": { "x": -2605753.0290850536, "y": 4756566.72707417, "z": 3345271.841355734 } }, { "name": "唐家窑", "clampedCartesian": { "x": -2601571.091772211, "y": 4754051.137111694, "z": 3352029.348595447 } }, { "name": "孙家店", "clampedCartesian": { "x": -2602912.886712108, "y": 4758973.890657058, "z": 3344053.4660831024 } }, { "name": "塘头徐", "clampedCartesian": { "x": -4871.549331552815, "y": 8907.61371100042, "z": -16261.286066824105 } }, { "name": "陶家院", "clampedCartesian": { "x": -2602627.9454567996, "y": 4756310.869922065, "z": 3348024.0929990276 } }, { "name": "下砖墙", "clampedCartesian": { "x": -2598661.378803709, "y": 4759373.8086655615, "z": 3346735.7760150856 } }, { "name": "王村", "clampedCartesian": { "x": -2600349.5232464545, "y": 4755478.7500116285, "z": 3350933.858507002 } }, { "name": "铜库", "clampedCartesian": { "x": -2604308.914200792, "y": 4753792.359856672, "z": 3350305.7383717075 } }, { "name": "王家村", "clampedCartesian": { "x": -2605008.375517921, "y": 4756726.9589595925, "z": 3345616.6676243544 } }, { "name": "乌石岗", "clampedCartesian": { "x": -2603559.2584251915, "y": 4751933.226189037, "z": 3353460.371067269 } }, { "name": "梧桐树", "clampedCartesian": { "x": -2605431.319502913, "y": 4756059.858610715, "z": 3346237.285274636 } }, { "name": "谷里街道吴家", "clampedCartesian": { "x": -2598758.4722042424, "y": 4758946.76053073, "z": 3347271.3426032998 } }, { "name": "谷里街道吴村", "clampedCartesian": { "x": -2602275.4698040495, "y": 4755331.521639534, "z": 3349665.3083025073 } }, { "name": "吴家庄", "clampedCartesian": { "x": -2602711.2415772276, "y": 4753769.422434511, "z": 3351519.9145521983 } }, { "name": "西山口", "clampedCartesian": { "x": -2603822.8356649494, "y": 4759319.232616876, "z": 3342847.40171881 } }, { "name": "谷里街道吴庄", "clampedCartesian": { "x": -2605441.8000239837, "y": 4757723.625590691, "z": 3343883.032879739 } }, { "name": "谷里街道西湖", "clampedCartesian": { "x": -4858.141979075503, "y": 8886.922126811929, "z": -16255.698528544046 } }, { "name": "西塘村", "clampedCartesian": { "x": -2602033.2741787294, "y": 4754817.378186562, "z": 3350571.2134922957 } }, { "name": "西宕", "clampedCartesian": { "x": -2603661.771741823, "y": 4754441.865578778, "z": 3349849.611288322 } }, { "name": "小甘里", "clampedCartesian": { "x": -2601646.8592812307, "y": 4755723.072847697, "z": 3349597.9792478248 } }, { "name": "小后坟", "clampedCartesian": { "x": -4862.4992061425, "y": 8886.14942992013, "z": -16256.419134285767 } }, { "name": "小湖村", "clampedCartesian": { "x": -2602108.920764105, "y": 4758517.828002567, "z": 3345324.445833104 } }, { "name": "小段山", "clampedCartesian": { "x": -2602103.6907145833, "y": 4753786.058266325, "z": 3351984.026031269 } }, { "name": "小荆村", "clampedCartesian": { "x": -2601581.9170008455, "y": 4753406.849004798, "z": 3352908.9299886366 } }, { "name": "新塘", "clampedCartesian": { "x": -4865.627195871435, "y": 8880.903519976884, "z": -16255.30922686588 } }, { "name": "小栏杆", "clampedCartesian": { "x": -2603035.9126452226, "y": 4758387.9938560445, "z": 3344768.446436762 } }, { "name": "小泉村", "clampedCartesian": { "x": -4873.7593704690225, "y": 8897.500831004232, "z": -16259.548652970232 } }, { "name": "小马湾", "clampedCartesian": { "x": -2600389.4225906976, "y": 4754294.260087672, "z": 3352558.049136904 } }, { "name": "雅塘杨", "clampedCartesian": { "x": -2605051.9551112233, "y": 4757679.715764814, "z": 3344249.060612547 } }, { "name": "小孙村", "clampedCartesian": { "x": -2600954.9844478015, "y": 4753526.606736081, "z": 3353208.5556040304 } }, { "name": "小塘", "clampedCartesian": { "x": -2604387.040518475, "y": 4757968.723307388, "z": 3344346.718488642 } }, { "name": "小湾沟", "clampedCartesian": { "x": -4861.068105795421, "y": 8890.77530991286, "z": -16256.768073509447 } }, { "name": "小夏", "clampedCartesian": { "x": -2605019.6710582646, "y": 4758484.456389844, "z": 3343101.7999077407 } }, { "name": "谷里街道新村", "clampedCartesian": { "x": -2600647.743114054, "y": 4756610.076763746, "z": 3349112.6897255983 } }, { "name": "小夏家", "clampedCartesian": { "x": -2605373.731033302, "y": 4756781.890747613, "z": 3345267.1370152426 } }, { "name": "张家凹", "clampedCartesian": { "x": -2599772.6850497434, "y": 4756792.468682944, "z": 3349521.8349786033 } }, { "name": "孝义村", "clampedCartesian": { "x": -2602371.6915510353, "y": 4754427.342790341, "z": 3350867.560668047 } }, { "name": "新华", "clampedCartesian": { "x": -2604213.9716202253, "y": 4757910.133022729, "z": 3344553.8624783345 } }, { "name": "新山", "clampedCartesian": { "x": -2604827.865493935, "y": 4757524.280336513, "z": 3344627.426437513 } }, { "name": "徐家院", "clampedCartesian": { "x": -2602031.575853274, "y": 4758055.514427142, "z": 3346034.3245645296 } }, { "name": "支家", "clampedCartesian": { "x": -2598984.135620637, "y": 4758400.233105948, "z": 3347879.026673114 } }, { "name": "谷里街道薛家凹", "clampedCartesian": { "x": -2600371.1913872035, "y": 4758533.366703263, "z": 3346637.345349355 } }, { "name": "薛塘头", "clampedCartesian": { "x": -4858.955556643195, "y": 8884.78130977787, "z": -16255.527209940366 } }, { "name": "谷里街道严村", "clampedCartesian": { "x": -2602490.342520437, "y": 4753484.176418428, "z": 3352090.7146465997 } }, { "name": "杨村", "clampedCartesian": { "x": -4881.076576990075, "y": 8916.733990188688, "z": -16264.042560615577 } }, { "name": "砻篰塘东", "clampedCartesian": { "x": -2603221.246305204, "y": 4759436.107329498, "z": 3343160.5914273174 } }, { "name": "尹都庄", "clampedCartesian": { "x": -2599136.2370319134, "y": 4756392.4938777415, "z": 3350560.4947262397 } }, { "name": "俞家岗", "clampedCartesian": { "x": -2602793.723050956, "y": 4756898.596955112, "z": 3347074.7274373397 } }, { "name": "张槐村", "clampedCartesian": { "x": -2602911.1957019567, "y": 4753485.017445577, "z": 3351778.325015699 } }, { "name": "西村", "clampedCartesian": { "x": -4856.889111731201, "y": 8897.068053415045, "z": -16257.69376927521 } }, { "name": "张家宕子", "clampedCartesian": { "x": -2604957.4091441776, "y": 4758647.281007157, "z": 3342919.905456493 } }, { "name": "张溪桥", "clampedCartesian": { "x": -2603425.5451401104, "y": 4759018.161988825, "z": 3343583.7973452555 } }, { "name": "谷里街道张家", "clampedCartesian": { "x": -4873.241443253588, "y": 8893.642030137591, "z": -16259.299806361087 } }, { "name": "赵府村", "clampedCartesian": { "x": -2598058.18499863, "y": 4759250.810127461, "z": 3347363.3319166396 } }, { "name": "江宁街道长冲", "clampedCartesian": { "x": -2602063.5370924524, "y": 4759061.479839738, "z": 3344584.8091726955 } }, { "name": "谷里街道赵家", "clampedCartesian": { "x": -2598455.138472419, "y": 4758340.7371487, "z": 3348361.508630448 } }, { "name": "芝塘", "clampedCartesian": { "x": -2604053.7030647392, "y": 4757393.7226403635, "z": 3345404.9653598107 } }, { "name": "赵府岗", "clampedCartesian": { "x": -4854.888574643061, "y": 8893.146474763751, "z": -16256.572677620221 } }, { "name": "泉庄", "clampedCartesian": { "x": -4879.550337925553, "y": 8902.248288883828, "z": -16261.141467851121 } }, { "name": "赵林", "clampedCartesian": { "x": -2604623.612919456, "y": 4757522.769200218, "z": 3344780.286958053 } }, { "name": "中宕", "clampedCartesian": { "x": -2604049.0852361238, "y": 4754056.334043041, "z": 3350108.574927243 } }, { "name": "朱家碾", "clampedCartesian": { "x": -2599270.1564151477, "y": 4756574.131057629, "z": 3350216.447391247 } }, { "name": "周家窑", "clampedCartesian": { "x": -2606066.8394025513, "y": 4757050.723399864, "z": 3344346.182389723 } }, { "name": "旦里余", "clampedCartesian": { "x": -2606990.158292544, "y": 4758068.459523021, "z": 3342202.343467126 } }, { "name": "竹园李", "clampedCartesian": { "x": -2606310.0144678443, "y": 4757188.403986121, "z": 3343974.9884875896 } }, { "name": "庄村", "clampedCartesian": { "x": -2601815.3188192956, "y": 4757820.648540964, "z": 3346532.211947156 } }, { "name": "岱家庄", "clampedCartesian": { "x": -2603266.5530784694, "y": 4752501.449642614, "z": 3352926.944560881 } }, { "name": "兴范", "clampedCartesian": { "x": -2607191.564658925, "y": 4759212.8377688555, "z": 3340424.4779530363 } }, { "name": "砻篰塘西", "clampedCartesian": { "x": -2603822.698927883, "y": 4759040.29164122, "z": 3343246.121220269 } }, { "name": "西毗金", "clampedCartesian": { "x": -2607244.1311484417, "y": 4758297.056296508, "z": 3341643.7700645933 } }, { "name": "中星", "clampedCartesian": { "x": -2607799.143687173, "y": 4758856.070844591, "z": 3340442.217076096 } }, { "name": "高公", "clampedCartesian": { "x": -4858.640988859348, "y": 8901.58981547784, "z": -16258.561604317743 } }, { "name": "新府", "clampedCartesian": { "x": -2602111.5814229986, "y": 4759426.543428193, "z": 3344017.458677603 } }, { "name": "王家坟", "clampedCartesian": { "x": -2605725.537639256, "y": 4753423.295014357, "z": 3349744.6477559158 } }, { "name": "大北山", "clampedCartesian": { "x": -2605301.0591156427, "y": 4753940.947997165, "z": 3349328.2966744797 } }, { "name": "金尹村", "clampedCartesian": { "x": -2605085.521917699, "y": 4754441.617346624, "z": 3348787.6393927988 } }, { "name": "秣陵街道小北山", "clampedCartesian": { "x": -2605547.2740336685, "y": 4754102.71765278, "z": 3348904.2361112274 } }, { "name": "蔡塘", "clampedCartesian": { "x": -4859.403226220515, "y": 8870.707581134513, "z": -16252.836637380067 } }, { "name": "观音殿", "clampedCartesian": { "x": -2605800.473526672, "y": 4758239.30336458, "z": 3342854.8390322183 } }, { "name": "西毗夏", "clampedCartesian": { "x": -2607090.23084435, "y": 4758739.972916017, "z": 3341165.3651453513 } }, { "name": "小西毗夏", "clampedCartesian": { "x": -2606860.8467715485, "y": 4758734.099060655, "z": 3341345.1792026698 } }, { "name": "山凹李", "clampedCartesian": { "x": -2606955.62875064, "y": 4755531.50137309, "z": 3345845.5909181563 } }, { "name": "谷里站", "clampedCartesian": { "x": -2604108.845331911, "y": 4755745.789112833, "z": 3347692.9135434697 } }, { "name": "竹丝塘", "clampedCartesian": { "x": -2606313.3180582263, "y": 4757864.899292133, "z": 3343014.558637176 } }, { "name": "宁马高速公路收费站", "clampedCartesian": { "x": -2598407.0641219714, "y": 4758536.031058514, "z": 3348115.426875613 } }, { "name": "肖家桥水闸", "clampedCartesian": { "x": -2600089.7645755066, "y": 4755891.735822168, "z": 3350530.7006386304 } }, { "name": "中石化谷里加油站", "clampedCartesian": { "x": -2603166.3482552934, "y": 4755812.190431832, "z": 3348309.712260449 } }, { "name": "龙卧坝水闸", "clampedCartesian": { "x": -2603257.966503431, "y": 4758359.361306605, "z": 3344635.9671888505 } }, { "name": "张西桥", "clampedCartesian": { "x": -2603257.393820941, "y": 4758362.103443383, "z": 3344632.4648881787 } }, { "name": "下坝主闸", "clampedCartesian": { "x": -4867.511178476736, "y": 8900.133425612934, "z": -16259.401822835207 } }, { "name": "下坝分洪闸", "clampedCartesian": { "x": -2601263.2251389334, "y": 4756553.287634627, "z": 3348706.3884304254 } }, { "name": "谷里砖墙通信基站", "clampedCartesian": { "x": -2598674.6526998915, "y": 4759018.508613798, "z": 3347226.2326288405 } }, { "name": "银杏湖高尔夫球场", "clampedCartesian": { "x": -2606148.0760024027, "y": 4758405.184343152, "z": 3342356.883840844 } }, { "name": "谷里青年路通信基站", "clampedCartesian": { "x": -2601406.0753556797, "y": 4757232.965281902, "z": 3347651.160019363 } }, { "name": "35kV谷里变电站", "clampedCartesian": { "x": -2602433.3519750726, "y": 4756233.508276587, "z": 3348291.1472668294 } }, { "name": "谷昌商贸中心", "clampedCartesian": { "x": -4869.772923777811, "y": 8904.519404556602, "z": -16260.299559017643 } }, { "name": "梦都街区", "clampedCartesian": { "x": -2603206.078052777, "y": 4755097.917312349, "z": 3349305.4564740043 } }, { "name": "江宁区谷里中心幼儿园", "clampedCartesian": { "x": -2602378.49181867, "y": 4756309.879120546, "z": 3348235.8686440457 } }, { "name": "江宁区谷里初级中学", "clampedCartesian": { "x": -2602348.537997222, "y": 4756463.910779147, "z": 3348026.172066006 } }, { "name": "谷里交警中队", "clampedCartesian": { "x": -2603223.365807153, "y": 4755716.869867921, "z": 3348438.6836245265 } }, { "name": "大袋子冲", "clampedCartesian": { "x": -2600145.3050795523, "y": 4756462.2214151, "z": 3349700.858328033 } }, { "name": "谷里派出所", "clampedCartesian": { "x": -2603219.226755718, "y": 4755717.782390016, "z": 3348440.426477555 } }, { "name": "谷里街道办事处", "clampedCartesian": { "x": -2603243.966561211, "y": 4755678.6331576165, "z": 3348472.6828005533 } }, { "name": "江宁区谷里中心小学", "clampedCartesian": { "x": -2602637.778360173, "y": 4756166.324117449, "z": 3348225.8129997924 } }, { "name": "莲花塘", "clampedCartesian": { "x": -2601490.445660019, "y": 4756898.845407411, "z": 3348057.888482425 } }, { "name": "谷里街道社区卫生服务中心", "clampedCartesian": { "x": -2603547.877308014, "y": 4755767.351300884, "z": 3348086.5167374876 } }, { "name": "南京银杏湖农业观光休闲有限公司", "clampedCartesian": { "x": -2605488.072453888, "y": 4758669.3756968025, "z": 3342493.4631860284 } }, { "name": "三合村", "clampedCartesian": { "x": -2606451.1821399685, "y": 4758011.197561636, "z": 3342688.520667619 } }, { "name": "南京天环食品集团有限公司", "clampedCartesian": { "x": -2601201.334521794, "y": 4756000.615789047, "z": 3349537.1144147725 } }, { "name": "石塘张", "clampedCartesian": { "x": -4864.679664331954, "y": 8877.718284185044, "z": -16254.373157656752 } }, { "name": "南京银杏湖主题乐园", "clampedCartesian": { "x": -2606162.6069228095, "y": 4758513.692631492, "z": 3342208.1574332523 } }, { "name": "龙子岗", "clampedCartesian": { "x": -2607364.598817806, "y": 4756135.771064302, "z": 3344618.160200904 } }, { "name": "小袋子冲", "clampedCartesian": { "x": -2600193.647084103, "y": 4756211.398843399, "z": 3350017.155435802 } }, { "name": "孟水桥村", "clampedCartesian": { "x": -2600771.022026972, "y": 4755230.376259998, "z": 3350962.5285186064 } }, { "name": "小圩子", "clampedCartesian": { "x": -4869.773747178726, "y": 8902.964934125543, "z": -16260.284725462552 } }, { "name": "红土凹", "clampedCartesian": { "x": -2600794.622419096, "y": 4757326.527275144, "z": 3348007.923300995 } }, { "name": "小柏树", "clampedCartesian": { "x": -2599158.545767181, "y": 4757880.583386256, "z": 3348477.8874494196 } }, { "name": "大塘角", "clampedCartesian": { "x": -2599562.8444692777, "y": 4757363.444971559, "z": 3348884.2225379297 } }, { "name": "大槐湖", "clampedCartesian": { "x": -2600115.010263241, "y": 4757324.142277179, "z": 3348523.404122525 } }, { "name": "何家庄", "clampedCartesian": { "x": -2599346.679155527, "y": 4756981.640693787, "z": 3349594.6604106952 } }, { "name": "小槐湖", "clampedCartesian": { "x": -2600040.221810678, "y": 4757242.543564824, "z": 3348702.058164002 } }, { "name": "大荆村", "clampedCartesian": { "x": -2602039.9287497494, "y": 4752956.237818218, "z": 3353213.6625402635 } }, { "name": "姚家凹", "clampedCartesian": { "x": -4859.579432445578, "y": 8896.01465226151, "z": -16257.957757528406 } }, { "name": "石臼村", "clampedCartesian": { "x": -2601342.955191085, "y": 4757392.447563874, "z": 3347477.5410008593 } }, { "name": "小杨村", "clampedCartesian": { "x": -2604365.1956257336, "y": 4759157.988617641, "z": 3342664.9998264117 } }, { "name": "马大山", "clampedCartesian": { "x": -4855.483813134953, "y": 8878.628950608894, "z": -16254.20367684681 } }, { "name": "西毗胡", "clampedCartesian": { "x": -2607394.4671502737, "y": 4758418.427566079, "z": 3341364.403032296 } }];

let curlon = undefined
let curlat = undefined

export default {
	components: { plateLeft, plateRight },
	data() {
		return {
			card1: true,
			card2: true,
			card3: true,
			card4: true,
			cards: {
				url1: require('@/assets/speed/case/village/bt_xcqj.png'),
				url2: require('@/assets/speed/case/village/bt_xcqj_sel.png'),
				url3: require('@/assets/speed/case/village/bt_tsdm.png'),
				url4: require('@/assets/speed/case/village/bt_tsdm_sel.png'),
				url5: require('@/assets/speed/case/village/bt_lv.png'),
				url6: require('@/assets/speed/case/village/bt_lv_sel.png'),
				url7: require('@/assets/speed/case/village/bt_ncp.png'),
				url8: require('@/assets/speed/case/village/bt_ncp_sel.png')
			},
			left: true,
			right: true,
			message: true,
			popupInfo: {
				name: "",
				lng: "",
				lat: "",
				address: "黑龙江省佳本斯市同江市",
				remark: "八岔台公岔村道别亚路终点",
				photos: [
					'http://36.152.66.51:8088/3dtiles/八岔村/芒么巷起点.jpg',
					'http://36.152.66.51:8088/3dtiles/八岔村/芒么巷终点.jpg',
					'http://36.152.66.51:8088/3dtiles/八岔村/爱伊街终点.png',
					'http://36.152.66.51:8088/3dtiles/八岔村/爱伊姐起点.png',
					'http://36.152.66.51:8088/3dtiles/八岔村/毕拉巷起点.png',
					'http://36.152.66.51:8088/3dtiles/八岔村/毕拉巷终点.png',
					'http://36.152.66.51:8088/3dtiles/八岔村/八音街起点.png',
					'http://36.152.66.51:8088/3dtiles/八岔村/八音街终点.png',
					'http://36.152.66.51:8088/3dtiles/八岔村/别亚路起点.png',
					'http://36.152.66.51:8088/3dtiles/八岔村/别亚路终点.png',
				],
				describe: [
					"同江，黑龙江省辖县级市，由佳木斯市代管。同江地处黑龙江省东北部松花江与黑龙江两江交汇处南岸，东接抚远，南与富锦市、饶河县为邻，西临松花江与绥滨县相连，北隔黑龙江与俄罗斯犹太自治州相望，边境线长170公里。总面积6300平方公里， [25]  辖6镇2乡2民族乡，设有6个国营农场。",
					"1984年命名八岔村赫哲语八陈演变为八金，意为江的夹芯子1963年建八岔生产大队，屋八岔人民公社。1984年称八岔村，为八岔村民委员会驻地，厘八岔赫哲族乡。名称沿用至今。",
					"三江口是松花江与黑龙江的汇合处，为中俄边境处，位于黑龙江省佳木斯市同江市城东北4公里处，汇合后俗称“混同江”，故名为“三江口”，黑龙江自西而东流来，水呈墨绿色，平缓而坦荡；松花江泥沙较多呈黄色，黄色的松花江与黑色的黑龙江汇合后的江水汹涌澎湃，水色分明，东流数十里不混，是东北地区著名的自然奇观之一。",
					"黑龙江洪河国家级自然保护区位于黑龙江省三江平原腹地，同江市与抚远市交界处。面积21835公顷，主要保护对象为原始沼泽生态系统及珍禽。保护区内的植被仍保持原始状态，以草本沼泽植被和水生植被为主，间有岛状林分布。",
					"八岔岛国家级自然保护区位于同江市东北部八岔乡境内西部2公里处，地处三江平原腹地，为黑龙江冲击下的自然岛屿。由黑瞎子岛、男女岛等几个岛屿和黑龙江部份水域及三角泡等组成，总面积32014公顷。保护区仍保留原始风貌，无任何污染，环境优美，风景怡人，具有天然的旅游资源，区内有野生动物200余种，国家级保护动物有黑熊、鹿、黑琴鸟。主要保护动物是区内的水生、湿生、陆栖生物，属内地湿地与水域生态系统类型保护区。",
					"同江口岸位于黑龙江省东北部的松花江与黑龙江汇流处右岸，与俄罗斯下列宁斯阔耶口岸仅一江之隔。地处东经132°18′-134°17′，北纬47°35′-48°17′之间，同江口岸东与抚远县接壤，南与富锦市为邻，西临松花江与绥滨县一水相连。",
					"街津口位于黑龙江省佳木斯市同江市，距离同江市区东北45公里处，与俄罗斯隔江相望，是我国民族大家庭中“六小”民族之一的赫哲族聚居地。这里是赫哲族的聚居地，游客可深入当地人家，领略赫哲族以捕鱼为生的特有风俗。被誉为黑龙江的“边陲名胜”。",
					"同江市位于中温带湿润气候区，属于大陆性季风气候,四季差别明显。冬季严寒漫长，多西北风，气候干燥；夏季短暂，温热多雨，多偏南风，雨水集中，气候较为湿润；春、秋季节由于冬夏季风交替，气候多变，多大风天气。",
					"同江市地形属古老冲积沉降的沼泽平原，同时有外兴安岭零星余脉形成的少量山地，总的地势西南高、东北低，平均海拔45米至65米，坡降1/5000～1/8000，地貌组合差异不大。",
					"同江市土壤多属黑土、草甸土和白浆土，其中草甸土占全市土壤总面积的61.2%，黑土占21.1%，白浆土占5.3%。土地平坦，土质肥沃，适宜各种农作物种植。",
				]
			}


		}
	},
	created() {
		this.mapid = uuid.v4();
	},
	mounted() {
		this.initMap()
		// this.loadModel()
		// this.loadBillboard()


	},
	methods: {

		cardEvent(type) {
			if (type == 1) {
				if (this.tiles3dModel == undefined) {
					this.loadModel()
				}
				this.tiles3dModel.show = this.card1
				this.card1 = !this.card1
			}
			if (type == 2) {
				if (this.billboardCollection == undefined) {
					this.loadBillboard()
				}
				if (!this.card2) {
					this.closePopup()
				}
				this.billboardCollection.show = this.card2
				this.labelCollection.show = this.card2
				this.card2 = !this.card2

			}
			if (type == 3) {
				this.card3 = !this.card3
				ElMessage({
					message: '敬请期待！',
					type: 'success',
				})
			}
			if (type == 4) {
				this.card4 = !this.card4
				ElMessage({
					message: '敬请期待！',
					type: 'success',

				})
			}
		},
		initMap() {
			let data = {
				containID: this.mapid,
				terrains: [
					{
						type: "xt",
						name: "星图地形",
						icon: "img/basemaps/terrain.png",
						tooltip: "星图地球提供的地形服务",
						url: "https://tiles1.geovisearth.com/base/v1/terrain",
					}
				],
				basemaps: [
					{
						type: "xyz",
						name: "江苏影像",
						icon: "img/basemaps/tdt_img.png",
						tooltip: "江苏影像服务",
						url: "http://36.152.66.51:18088/{z}/{x}/{reverseY}.jpg",
					}
				],
				navigationControl: {
					legend: {
						show: true,
						style: { left: "5px", bottom: "1px" }
					}
				},//导航球、比例尺
				statusBar: true,//状态栏
				center: { lat: 31.863694, lng: 118.804138, alt: 10000, heading: 0, pitch: -90, duration: 0 },

			};
			this.speedMap = new Speed.SpeedViewer()
			this.map = this.speedMap.init(data);

			//叠加注记
			let zjlayer = Speed.tdtLayer.tdtImageryProvider({
				type: "tdt",
				layer: "img_z",
				crs: "4326",
				key: token.tianditu,
			})
			this.map._viewer.imageryLayers.addImageryProvider(zjlayer);
		},
		loadWMS() {
			let curLayer = Speed.WMSLayer.wmsImageryLayer({
				url: "http://172.16.30.39:7000/geoserver/zhkt/wms",
				layers: "zhkt:dzdm",
				parameters: {
					transparent: true,
					format: "image/png"
				},
				rectangle: {
					xmin: 118.49839782714844,
					xmax: 119.10987854003906,
					ymin: 31.61618995666504,
					ymax: 32.11119842529297
				}
			})
			this.speedMap.flyto(curLayer)
			this.speedMap.addLayer(curLayer)
		},
		loadModel() {
			this.tilesetLayer = new Speed.TilesetLayer()
			let tileset = this.tilesetLayer.loadTilesetLayer({
				url: "http://36.152.66.51:8088/3dtiles/南京谷里/tileset.json",
			});
			this.tiles3dModel = tileset._tileset
			this.speedMap.addLayer(this.tiles3dModel)
			this.speedMap.flyto(this.tiles3dModel)
		},
		loadBillboard() {
			let that = this;

			this.billboardCollection = new Cesium.BillboardCollection({ scene: this.map._viewer.scene });
			this.labelCollection = new Cesium.LabelCollection({ scene: this.map._viewer.scene });
			this.map._viewer.scene.primitives.add(this.billboardCollection);
			this.map._viewer.scene.primitives.add(this.labelCollection)

			feature.forEach((obj, index) => {
				this.labelCollection.add({
					id: index,
					position: obj.clampedCartesian,// Cesium.Cartesian3.fromDegrees(position[0], position[1]),
					text: obj.name,
					font: '18px sans-serif',
					verticalOrigin: Cesium.VerticalOrigin.BOTTOM,
					horizontalOrigin: Cesium.HorizontalOrigin.CENTER,
					pixelOffset: new Cesium.Cartesian2(0, -35),
					distanceDisplayCondition: new Cesium.DistanceDisplayCondition(0, 20000),
					showBackground: true,
					backgroundColor: new Cesium.Color.fromCssColorString('rgba(0,225,253,0.5)'),
					// heightReference:Cesium.HeightReference.RELATIVE_TO_GROUND,
					disableDepthTestDistance: Number.POSITIVE_INFINITY
				});
				this.billboardCollection.add({
					id: index,
					position: obj.clampedCartesian,//Cesium.Cartesian3.fromDegrees(position[0], position[1]),
					image: require("@/assets/speed/case/village/img_dwd.png"),
					scale: 0.8,
					horizontalOrigin: Cesium.HorizontalOrigin.CENTER,
					verticalOrigin: Cesium.VerticalOrigin.BOTTOM,
					distanceDisplayCondition: new Cesium.DistanceDisplayCondition(0, 50000),
					// heightReference:Cesium.HeightReference.RELATIVE_TO_GROUND,
					disableDepthTestDistance: Number.POSITIVE_INFINITY
				})
			})

			const handler = new Cesium.ScreenSpaceEventHandler(this.map._viewer.scene.canvas);
			handler.setInputAction(function (movement) {
				const pickedObject = that.map._viewer.scene.pick(movement.endPosition);
				if (Cesium.defined(pickedObject)) {
					that.billboardCollection._billboards.forEach(billboard => {
						if (billboard._id === pickedObject.id) {
							billboard.scale = 1;
						} else {
							billboard.scale = 0.8;
						}
					});
					that.labelCollection._labels.forEach(label => {
						if (label._id === pickedObject.id) {
							label.scale = 1;
							label.pixelOffset = new Cesium.Cartesian2(0, -50)
						} else {
							label.scale = 0.8;
							label.pixelOffset = new Cesium.Cartesian2(0, -38)
						}
					});
				}
			}, Cesium.ScreenSpaceEventType.MOUSE_MOVE);
			this.curbillboard = undefined
			this.curlabel = undefined
			handler.setInputAction(function (movement) {
				const pickedObject = that.map._viewer.scene.pick(movement.position);
				if (Cesium.defined(pickedObject)) {
					if (pickedObject.id == undefined) {
						that.closePopup()
						curlon = undefined
						curlat = undefined
						that.curbillboard.image = require("@/assets/speed/case/village/img_dwd.png")
						that.curlabel.showBackground = true
						that.curlabel.backgroundColor = new Cesium.Color.fromCssColorString('rgba(0,225,253,0.5)')
					} else {
						that.billboardCollection._billboards.forEach(billboard => {
							if (billboard._id === pickedObject.id) {
								that.curbillboard = billboard
								billboard.image = require("@/assets/speed/case/village/img_dwd_sel.png");
								// 世界坐标转换为弧度
								let ellipsoid = that.map._viewer.scene.globe.ellipsoid;
								let cartographic = ellipsoid.cartesianToCartographic(billboard._position);
								// 弧度转换为经纬度
								let lng = Cesium.Math.toDegrees(cartographic.longitude);  // 经度
								let lat = Cesium.Math.toDegrees(cartographic.latitude);   // 纬度
								let alt = cartographic.height;	// 高度

								// that.speedMap.flyto({
								// 	destination: Cesium.Cartesian3.fromDegrees(lng, lat - 0.03, 2000),
								// 	orientation: {
								// 		heading: Cesium.Math.toRadians(0),
								// 		pitch: Cesium.Math.toRadians(-30),
								// 		roll: Cesium.Math.toRadians(0)
								// 	},
								// 	duration: 1
								// })

								that.popupInfo.lng = lng.toFixed(6);
								that.popupInfo.lat = lat.toFixed(6);
								var obj = {
									lng: lng,
									lat: lat,
									height: alt
								};
								if (curlon === lng && curlat === lat) {
									that.closePopup()
									billboard.image = require("@/assets/speed/case/village/img_dwd.png")
									curlon = undefined
									curlat = undefined
								} else {
									that.addPopup(obj);
									curlon = lng
									curlat = lat
								}
							} else {
								billboard.image = require("@/assets/speed/case/village/img_dwd.png")
							}

						});
						that.labelCollection._labels.forEach(label => {
							if (label._id === pickedObject.id) {
								that.curlabel = label
								that.popupInfo.name = label.text
								label.showBackground = true
								label.backgroundColor = new Cesium.Color.fromCssColorString('rgba(0,176,255,0.5)')
							} else {
								label.showBackground = true
								label.backgroundColor = new Cesium.Color.fromCssColorString('rgba(0,225,253,0.5)')
							}
						});
					}

				} else {
					that.closePopup()
					curlon = undefined
					curlat = undefined
					that.curbillboard.image = require("@/assets/speed/case/village/img_dwd.png")
					that.curlabel.showBackground = true
					that.curlabel.backgroundColor = new Cesium.Color.fromCssColorString('rgba(0,225,253,0.5)')
				}
			}, Cesium.ScreenSpaceEventType.LEFT_CLICK);

		},
		addPopup(obj) {
			let that = this
			let popupHtml = document.getElementById("info-popup");
			popupHtml.style.display = "block";

			let result = new Cesium.Cartesian2();
			this.map._viewer.scene.preRender.addEventListener(function () {
				let position = Cesium.Cartesian3.fromDegrees(obj.lng, obj.lat, obj.height);
				let canvasPosition = that.map._viewer.scene.cartesianToCanvasCoordinates(
					position,
					result
				);
				if (Cesium.defined(canvasPosition)) {
					popupHtml.style.position = "fixed"
					popupHtml.style.top = canvasPosition.y - popupHtml.offsetHeight - 60 + "px";
					popupHtml.style.left = canvasPosition.x - popupHtml.offsetWidth / 2 + "px";
				}
			});
		},
		closePopup() {
			let popupHtml = document.getElementById("info-popup");
			popupHtml.style.display = 'none';
		},
		openNewPage() {
			window.open("http://36.152.66.51:9000/StreatDemo/index.html", "_blank")
		},

	},
};
</script>
<style>
.village {
	width: 100%;
	height: 100%;
	position: relative;
}

.ktmap {
	width: 100%;
	height: 100%;
	position: absolute;
}

.cesium-popup {
	position: absolute;
	z-index: 999;
	/* left: 0;
	top: 5px; */
	/* text-align: left; */
	display: none;

}

.cesium-popup-background {
	background: url('@/assets/speed/case/village/bg.png') no-repeat;
	background-size: 100% 100%;
	width: 360px;
	height: 220px;
	/* background: rgb(27 89 98 / 70%); */
	/* border-radius: 6px; */
	padding: 5px 0;
}

.cesium-popup-content-wrapper {
	text-align: center;
	max-height: 600px;
	overflow-y: auto;
	box-shadow: 0 3px 14px rgba(0, 0, 0, .4);
	text-align: left;
	border-radius: 3px;
}

.cesium-popup-color {
	color: white;
}

.cesium-popup-content {
	margin: 15px 10px 10px;
	line-height: 1.4;
	font-size: 13px;
}

.cesium-popup-tip-container {
	margin: 0 auto;
	width: 40px;
	height: 13px;
	position: relative;
	overflow: hidden;
}

.cesium-popup-tip {
	box-shadow: 0 3px 14px rgba(0, 0, 0, .4);
	width: 17px;
	height: 17px;
	padding: 1px;
	margin: -10px auto 0;
	-webkit-transform: rotate(45deg);
	transform: rotate(45deg);
}

.cesium-popup-close-button {
	position: absolute;
	top: 0;
	right: 0;
	padding: 4px 4px 0 0;
	text-align: center;
	width: 18px;
	height: 14px;
	font: 16px/14px Tahoma, Verdana, sans-serif;
	text-decoration: none;
	font-weight: 700;
	background: transparent;
	z-index: 9999;
}

.cesium-popup-close-button:hover {
	cursor: pointer;
	color: #23527c;
}

td {
	min-width: 50px;
}

.header {
	width: 100%;
	height: 10.6%;
	z-index: 1;
	position: fixed;
	background-image: url("@/assets/speed/case/village/top1.png")
}

#plateLeft {
	animation: inLeft 1.5s 1 cubic-bezier(0.215, 0.610, 0.355, 1.000);
}

@keyframes inLeft {
	0% {
		opacity: 0;
		transform: translate3d(-3000px, 0, 0);
	}

	50% {
		opacity: 0.5;
		transform: translate3d(15px, 0, 0);
	}

	70% {
		opacity: 1;
		transform: translate3d(35px, 0, 0);
	}

	80% {
		transform: translate3d(-10px, 0, 0);
	}

	90% {
		transform: translate3d(5px, 0, 0);
	}

	100% {
		transform: none;
	}
}

#plateRight {
	animation: inRight 1.5s 1 cubic-bezier(0.215, 0.610, 0.355, 1.000);
}

@keyframes inRight {
	0% {
		opacity: 0;
		transform: translate3d(3000px, 0, 0);
	}

	50% {
		opacity: 0.5;
		transform: translate3d(15px, 0, 0);
	}

	70% {
		opacity: 1;
		transform: translate3d(35px, 0, 0);
	}

	80% {
		transform: translate3d(-10px, 0, 0);
	}

	90% {
		transform: translate3d(5px, 0, 0);
	}

	100% {
		transform: none;
	}
}


#bottom {
	width: 30%;
	height: 4.5%;
	position: fixed;
	background: url("@/assets/speed/case/village/down.png") no-repeat;
	background-size: 100% 100%;
	left: 35%;
	bottom: 3%;
	z-index: 10;
	text-align: center;
}

.bottom_img {
	width: 88px;
	height: 65px;
}

.bottom_img:hover {
	transition: 1s;
	transform: scale(1.1);
	cursor: pointer;
}





.b_card {
	display: inline-block;
	position: relative;
	bottom: 100%
}

.b_name {
	font-size: 14px;
	color: azure;

}

.message {
	background: url("@/assets/speed/case/village/img_xx.png") no-repeat;
	background-size: 100% 100%;
	width: 37%;
	height: 4.3%;
	position: fixed;
	top: 10%;
	left: 31.5%;
	z-index: 10;
	color: #FFFFFF;
	font-size: 14PX;
	text-align: center;
	/* vertical-align: middle; */
	line-height: 3;
}


.tooltip-content {
	width: 50%;
	height: 90%;
	float: left;
	text-align: center;
	/* display: flex;
	justify-content: center; */
}

.tooltip-pic {
	padding-left: 5%;
	padding-top: 5%;
	padding-bottom: 5%;
}

.tooltip-intr {
	padding: 5%;
	overflow: hidden;
	text-overflow: ellipsis;
}

.tooltip-content-explain1 {
	width: 100%;
	height: 40%;
}

.tooltip-content-explain2 {
	width: 100%;
	height: 50%;
}

.tooltip-name {

	font-size: 16px;
	font-family: Source Han Sans CN, Source Han Sans CN-Bold;
	font-weight: 700;
	text-align: left;
	color: #ffffff;
	letter-spacing: 1.6px;
	padding-left: 45px;
	padding-top: 6px;
}

.tooltip-photo {
	width: 100%;
	height: 100%;
}

.tooltip-content-title {
	font-size: 14px;
	font-family: Source Han Sans CN, Source Han Sans CN-Bold;
	font-weight: 700;
	text-align: left;
	color: #48dee6;
	overflow: hidden;
	width: 100%;
	height: 30%;
}

.tooltip-content-describe {
	font-size: 12px;
	font-family: Source Han Sans CN, Source Han Sans CN-Regular;
	font-weight: 400;
	text-align: left;
	color: #ffffff;
	overflow: hidden;
	text-overflow: ellipsis;
	width: 100%;
	height: 70%;
}

.link {
	right: 5%;
}
</style>
